31 35032
46 33165
41 27437
384 18873
45 18247
92 14233
496 13939
39 13903
1616 12022
40 11654
1255 11182
33 9974
5 9513
1210 9448
44 8545
1013 8398
36 8380
17133 8222
9038 8172
1828 7603
73 7008
17250 6683
4469 6492
522 6106
112 6056
111 5866
7263 5724
3796 5362
49 5264
9065 5075
1157 4698
24 4682
13 4523
1121 4466
5644 4356
100 4154
1362 4078
14786 4017
34 3988
795 3958
43 3932
809 3832
182 3712
221 3712
1463 3629
9593 3556
11854 3505
37 3468
324 3403
2121 3391
843 3378
568 3305
305 3295
507 3226
4725 3099
4317 3014
1865 2963
10385 2961
6750 2961
5034 2914
457 2913
4179 2849
9565 2787
18512 2698
15373 2680
197 2656
51 2609
7526 2577
9 2575
7555 2554
153 2547
6991 2544
829 2540
14746 2527
148 2526
1181 2473
14 2469
14720 2458
3409 2443
4839 2392
3412 2359
196 2353
1244 2307
11812 2291
5646 2290
17248 2247
74 2244
5519 2227
587 2215
10935 2198
23 2191
345 2185
2396 2142
2497 2129
17070 2126
19 2111
14853 2100
1105 2079
573 2058
552 2038
7675 2027
71 1981
8645 1980
2975 1967
5798 1947
7843 1942
225 1925
17155 1924
822 1893
75 1877
8230 1875
1599 1865
947 1844
330 1834
7853 1813
1270 1800
163 1790
346 1782
132 1738
1222 1735
13331 1702
528 1695
559 1685
7268 1683
11793 1664
9534 1631
1566 1597
11888 1587
1064 1582
1695 1580
56 1564
77 1562
2171 1561
1343 1555
25 1542
6487 1540
9586 1525
4566 1504
14519 1500
6626 1476
2600 1458
12 1439
4635 1424
152 1410
4178 1409
107 1382
560 1367
176 1352
8198 1348
38 1333
7874 1330
1607 1323
2865 1322
14764 1316
1224 1309
10933 1306
101 1303
4794 1293
89 1286
11876 1283
11762 1249
5123 1232
14790 1224
2172 1222
11866 1220
202 1211
29 1211
2759 1209
1236 1202
4323 1197
17846 1191
4326 1176
65 1176
1642 1172
8619 1163
17374 1161
97 1155
1008 1144
2500 1144
2242 1140
4109 1140
199 1132
1342 1127
4055 1126
10245 1124
108 1119
255 1112
1439 1097
12971 1091
6765 1091
17766 1076
1291 1070
192 1062
12986 1058
26 1055
2468 1045
8190 1045
122 1039
474 1038
593 1033
786 1030
1292 1029
1308 1027
17645 1027
17032 1025
3289 1023
7836 1020
15 1016
253 1013
1305 1001
271 995
96 995
4180 991
7260 982
6729 981
968 978
10504 967
5307 967
17071 957
663 955
14694 951
6514 951
252 940
1541 934
1644 923
164 922
11072 917
2510 913
3558 912
154 910
9684 910
2568 902
14639 900
397 896
988 888
1012 878
3559 867
4191 865
78 860
13015 858
11791 849
13095 849
2998 849
48 846
17240 839
2840 838
4931 837
1256 827
14893 825
8219 821
282 820
17152 810
161 804
16984 804
17 803
16188 802
6990 801
2873 796
544 796
104 795
2356 795
4724 790
2713 786
6525 785
138 779
17037 777
448 770
9707 763
8621 759
1172 758
3854 745
747 737
10204 732
10207 731
508 731
316 730
6520 730
12074 722
17457 720
480 719
19333 718
4728 708
10142 704
10922 699
10994 699
10174 693
4643 693
5855 692
4402 689
641 689
1478 687
14796 684
3333 683
3949 682
5249 682
1816 680
3451 676
1955 675
309 674
1672 673
85 673
1192 672
498 668
7258 666
1262 663
3323 661
5505 661
17582 658
5948 657
4726 655
1476 654
2038 650
4325 648
8496 648
8663 648
1263 647
3089 643
310 643
734 642
7847 638
9610 637
2013 636
5854 636
385 633
7213 633
400 629
9561 628
354 625
9544 623
360 622
1426 620
1626 618
6752 617
1034 615
15469 613
695 612
1100 611
6836 610
18127 609
3744 607
7279 604
1662 603
17148 603
748 603
6731 602
50 596
4418 592
864 592
4861 589
5772 589
11957 582
123 581
1572 579
4965 575
247 573
7834 571
3697 566
14638 564
10187 563
130 563
2525 563
5253 562
109 561
14644 559
16839 559
147 558
22 558
12350 556
416 554
4803 553
59 551
17075 550
18338 544
4744 544
7516 542
904 542
13006 537
9598 537
10458 536
7 536
4651 534
2365 533
11794 532
68 526
3199 524
140 518
9071 518
4905 516
3594 514
3514 511
9688 510
10259 507
3364 507
14645 506
6510 506
172 505
719 505
4636 504
542 503
9578 501
16945 500
2055 500
2418 498
10416 497
61 497
17129 496
2663 492
7835 488
1849 487
14773 486
10990 485
4072 485
7896 485
5635 483
393 482
772 482
13125 480
17031 480
2145 476
327 476
1015 474
149 469
3636 469
2308 468
6298 467
9556 466
3798 465
415 465
9280 465
286 459
2690 455
13083 453
285 453
17552 452
184 452
4644 452
955 450
9079 449
511 446
18 442
5258 442
9668 442
14642 441
1011 436
94 436
2170 432
883 431
11800 429
12340 429
7259 427
8582 426
4104 422
11953 421
4392 421
486 421
5512 421
841 419
2691 418
1133 417
17828 416
739 415
10180 414
14603 414
9559 414
866 413
1704 410
1975 410
14784 407
11907 406
525 404
3130 398
3849 397
17424 396
11492 395
118 395
8196 394
20 393
14923 390
7014 390
10140 388
6278 385
8589 385
940 385
11366 384
11811 384
20798 384
5654 384
911 383
1028 382
1186 382
5127 380
3917 379
4472 379
6747 377
13070 376
1969 376
8287 375
820 372
10930 371
79 371
110 370
1339 370
17241 369
7008 367
1247 365
2355 365
586 365
1116 364
127 364
2243 364
5068 363
7897 363
14589 361
17068 361
99 361
17356 359
17399 357
2607 356
17125 354
6373 353
5784 351
350 350
8199 350
5025 349
17358 346
5463 346
2861 344
14184 342
204 342
13224 340
638 340
11328 339
211 339
2479 334
14883 332
3858 331
7936 331
994 331
311 329
8955 329
9061 327
233 326
2530 326
7111 326
1194 325
10173 324
17544 323
412 323
922 323
14667 322
13229 320
18026 319
6903 318
14805 317
368 317
17701 315
10241 314
727 314
951 314
1606 312
18531 312
2255 312
10159 311
19034 311
13111 310
14569 309
8630 309
10222 308
972 307
1634 306
1082 304
5785 304
8191 302
9686 302
17249 300
251 300
10888 299
11276 299
13465 297
17252 297
18882 297
639 297
10322 296
1827 295
8636 294
8671 294
2058 293
723 293
13235 292
8649 291
260 290
194 289
298 289
561 289
9152 289
16167 288
7536 287
2219 286
9073 286
11819 285
1701 285
7518 285
270 282
493 282
1584 281
797 281
14851 280
1604 280
12037 279
13148 278
4049 278
3993 277
8708 277
10199 276
203 275
2736 275
2799 275
4209 275
9541 275
12809 274
7820 274
3608 273
7054 273
6 272
8171 272
3404 271
14861 270
2697 269
1784 267
11925 266
1151 265
14405 265
1945 265
339 263
4247 263
430 263
1227 262
8252 262
1152 261
664 261
3332 257
4324 257
6980 257
647 255
8256 255
2221 254
502 254
655 254
7541 254
13266 253
12090 252
13054 252
1494 252
1323 251
2280 251
1350 250
2478 249
10959 248
17202 248
19376 248
173 247
18153 246
11874 245
3989 245
858 245
9172 245
95 245
10226 244
12316 244
17288 244
603 244
10944 243
1554 242
535 242
5987 241
4116 240
6923 240
1043 239
13066 239
17126 239
3913 239
3231 238
16091 237
19343 234
2398 234
413 234
155 233
7971 233
11801 232
2586 232
2741 231
3915 231
14579 230
4331 229
1475 228
5265 228
14574 227
700 227
7264 226
13195 225
8177 224
13199 223
17425 223
1836 220
32 220
17033 219
9812 219
3262 217
17291 215
4123 215
11104 214
1451 214
17255 214
5944 214
12436 213
13084 213
1161 212
6145 211
595 210
597 210
1973 209
796 209
11790 208
5788 208
5971 208
341 207
10984 206
14892 205
7849 205
4664 204
103 203
6131 203
3090 202
10201 201
1792 201
2805 201
47 201
14705 200
6117 200
7528 200
141 199
14858 199
1162 198
17646 198
2150 198
2738 198
9017 198
14860 197
15562 197
1929 197
229 197
312 197
17613 196
5118 196
6495 196
67 196
698 196
11906 195
3173 194
5903 194
10945 193
9557 193
1235 192
232 192
246 191
4637 191
13637 190
17344 190
8169 190
87 190
1220 189
62 189
10208 188
14721 187
241 187
277 187
352 187
11796 186
12962 186
18409 186
18135 185
3817 185
11783 183
17185 183
17401 183
4917 183
4992 183
14714 182
1493 182
17203 182
1891 182
250 182
5983 182
6542 182
7244 182
8954 182
11079 179
17172 179
2903 179
6169 179
8575 179
2739 178
8269 177
1282 176
1643 176
11885 175
13186 175
6838 175
887 175
8062 174
10998 173
14625 173
300 173
616 173
15607 172
369 172
4926 172
2133 171
63 171
3694 170
3944 170
5267 170
551 169
1735 168
9064 167
17406 166
8179 166
10172 165
9692 165
10907 164
121 164
17719 164
3165 164
5042 164
8691 164
2400 163
4755 163
14612 162
3690 162
7824 162
1213 161
14912 161
17354 161
1760 161
72 161
17198 160
4657 160
4743 160
590 160
8220 159
8659 159
9647 159
10927 158
17360 158
4731 158
620 158
13436 157
19335 157
35 157
815 157
124 156
13073 156
16972 156
1904 156
7523 156
17302 155
2033 155
7841 155
11861 153
13055 153
13144 153
14928 153
845 153
9535 153
11326 152
11818 152
16974 152
18005 152
1815 152
2069 152
5946 152
5951 152
14956 151
7869 151
1155 150
3151 150
3519 150
6316 150
9025 150
1443 149
18680 149
461 149
2515 148
506 148
824 148
18682 147
226 147
3687 147
7030 147
7229 147
1557 146
2256 146
297 146
967 146
1109 145
1989 145
3280 145
6810 145
6998 145
7270 145
7871 145
10013 144
10051 144
2665 144
2737 144
8005 144
926 144
13184 142
14777 142
3020 142
5807 142
2787 141
12489 140
1313 140
17426 140
4398 140
6527 140
14666 139
1593 139
15963 139
19380 139
14687 138
2339 138
3507 138
9562 138
10958 137
12783 137
1435 137
14732 137
15564 137
3852 137
509 137
685 137
2381 136
394 136
670 136
106 135
119 135
14582 134
17293 134
18816 134
261 134
279 134
6112 134
619 134
8300 134
117 133
11845 133
11921 133
3773 133
4906 133
6297 133
9446 133
174 132
18382 132
2847 132
9682 132
10801 131
11795 131
12623 131
13127 131
1761 131
17626 131
17375 130
18516 130
2435 130
3208 130
11666 129
17636 128
5135 128
13686 127
14668 127
17497 127
10240 126
17095 126
19492 126
2126 126
3449 126
14834 125
15017 125
1507 125
1667 125
17078 125
17132 125
3804 125
4257 125
8243 125
9642 125
10993 124
14736 124
2307 124
3795 124
533 124
90 124
1107 123
11896 123
6757 123
7265 123
9573 123
10638 122
131 122
17610 122
4425 122
10918 121
1119 121
17217 120
8701 120
10906 119
12104 119
1400 119
18112 119
81 119
859 119
11833 118
17403 118
7250 118
9100 118
18025 117
210 117
3733 117
12028 116
1267 116
17001 116
227 116
5399 116
5781 116
8204 116
10978 115
12989 115
10169 114
2051 114
4837 114
7236 114
10299 113
356 113
60 113
10369 112
133 111
14665 111
175 111
1879 111
2689 111
3633 111
1918 110
1998 110
20336 110
8600 110
965 110
9704 110
3479 109
5021 109
5415 109
206 108
2715 108
1641 107
3203 107
4242 107
5395 107
7267 107
7900 107
10917 106
13169 106
16417 106
1775 106
2008 106
715 106
13008 105
1529 105
10145 104
13538 104
3898 104
8946 104
15631 103
3198 103
5520 103
11864 102
1788 102
2117 102
2271 102
3136 102
5376 102
588 102
6305 102
676 102
11068 101
11836 101
2897 101
5865 101
7357 101
11466 100
12221 100
14557 100
1552 100
17142 100
1751 100
2303 100
5179 100
6231 100
6507 100
11555 99
17051 99
17242 99
2694 99
9683 99
16946 98
17595 98
2757 98
3631 98
5879 98
10000 97
16049 97
17209 97
17251 97
3030 97
11188 96
1446 96
8193 96
102 95
12102 95
13256 95
15989 95
2090 95
4633 95
5382 95
5968 95
14817 94
1486 94
17259 94
2436 94
4236 94
459 94
945 94
10942 93
5588 93
8629 93
9575 93
14675 92
17151 92
272 92
2937 92
5131 92
7855 92
10155 91
11409 91
8304 91
14575 90
17352 90
17478 90
3092 90
3291 90
3335 90
9566 90
11865 89
12124 89
20390 89
3135 89
5787 89
643 89
6738 89
8192 89
13304 88
14256 88
14598 88
4560 88
1274 87
19560 87
4405 87
4689 87
9618 87
1344 86
17013 86
4741 86
4935 86
679 86
9055 86
1047 85
11875 85
12990 85
13102 85
13106 85
14541 85
14680 85
16958 85
276 85
4111 85
70 85
8264 85
10986 84
11697 84
11938 84
1561 84
1688 84
220 84
3799 84
6140 84
6699 84
7831 84
834 84
11308 83
13014 83
13557 83
14192 83
1466 83
180 83
1965 83
11782 82
3662 82
4000 82
11680 81
11878 81
13997 81
14178 81
17883 81
188 81
3872 81
5467 81
11770 80
12083 80
12110 80
17258 80
17572 80
2043 80
562 80
694 80
7956 80
7999 80
8627 80
14535 79
4400 79
9601 79
11803 78
17371 78
3166 78
3726 78
3862 78
8245 78
10179 77
1062 77
10903 77
14572 77
18479 77
2177 77
569 77
15305 76
18815 76
4337 76
499 76
5499 76
7742 76
9577 76
14637 75
2460 75
2662 75
3848 75
4320 75
7142 75
9051 75
14514 74
18059 74
1928 74
3475 74
3557 74
444 74
10366 73
11862 73
15203 73
1931 73
4095 73
4267 73
6289 73
8175 73
8222 73
11442 72
11890 72
13026 72
17114 72
2047 72
3731 72
6304 72
7623 72
9582 72
11840 71
13145 71
13346 71
1740 71
18111 71
2563 71
2565 71
292 71
4062 71
5270 71
13040 70
1893 70
254 70
2879 70
307 70
3258 70
363 70
437 70
4572 70
572 70
8195 70
9253 70
11825 69
15609 69
2068 69
2639 69
4205 69
4655 69
6532 69
954 69
13276 68
14185 68
14765 68
15934 68
2881 68
3125 68
3552 68
4908 68
7809 68
13707 67
1869 67
19890 67
4004 67
10157 66
10957 66
11649 66
13123 66
17295 66
17303 66
17537 66
1900 66
6310 66
6904 66
8 66
9608 66
10608 65
19753 65
19754 65
3351 65
5532 65
6383 65
14465 64
2093 64
2731 64
4173 64
6325 64
6911 64
7515 64
10491 63
12982 63
14654 63
14671 63
16405 63
17562 63
504 63
6740 63
830 63
9385 63
9543 63
16529 62
16737 62
1690 62
2516 62
2716 62
3108 62
5649 62
8260 62
9635 62
10939 61
1102 61
12952 61
16092 61
168 61
17317 61
17953 61
7566 61
11720 60
14901 60
17052 60
1852 60
19822 60
20048 60
2186 60
3515 60
3831 60
4884 60
5352 60
5683 60
10351 59
1088 59
13114 59
14643 59
17025 59
17343 59
3947 59
6268 59
9551 59
10166 58
13505 58
17178 58
1808 58
2439 58
5374 58
9042 58
10220 57
134 57
16493 57
1902 57
5999 57
6139 57
8580 57
10020 56
14627 56
19876 56
249 56
3505 56
376 56
7005 56
773 56
8112 56
9529 56
9632 56
10309 55
11924 55
13007 55
13178 55
17079 55
1977 55
396 55
4639 55
567 55
5853 55
8208 55
12015 54
13181 54
13362 54
17009 54
17011 54
17950 54
20691 54
5113 54
7078 54
7533 54
8583 54
975 54
11835 53
151 53
16977 53
18760 53
20202 53
3225 53
3567 53
4283 53
4470 53
5556 53
8141 53
874 53
9010 53
9119 53
9568 53
1153 52
18339 52
2270 52
3113 52
3168 52
526 52
5523 52
6987 52
8652 52
901 52
993 52
1035 51
143 51
14445 51
19066 51
2277 51
2838 51
557 51
7521 51
83 51
10263 50
16317 50
17149 50
17400 50
183 50
2542 50
3117 50
7641 50
953 50
13813 49
14690 49
15904 49
17147 49
17885 49
19378 49
1967 49
3101 49
5786 49
7524 49
7527 49
7569 49
10162 48
10301 48
11096 48
11797 48
18995 48
326 48
4169 48
6584 48
713 48
17742 47
17849 47
2157 47
3180 47
4793 47
5024 47
5120 47
10236 46
11369 46
13272 46
14769 46
17788 46
18978 46
3345 46
3454 46
403 46
6054 46
8185 46
9284 46
10190 45
11300 45
12978 45
17487 45
19084 45
19295 45
2944 45
4506 45
6544 45
7839 45
7930 45
9046 45
9122 45
10158 44
1180 44
12020 44
13005 44
14768 44
18699 44
2494 44
319 44
4574 44
8615 44
10336 43
10446 43
11060 43
11456 43
1329 43
14626 43
14783 43
17074 43
17935 43
19749 43
218 43
3643 43
623 43
6307 43
8424 43
9335 43
14573 42
14943 42
1859 42
1940 42
2631 42
4042 42
4742 42
5514 42
6267 42
6341 42
7568 42
8205 42
8218 42
8653 42
8658 42
913 42
11879 41
13757 41
20281 41
405 41
5511 41
6290 41
6985 41
7842 41
8581 41
9106 41
9536 41
12197 40
13038 40
13230 40
1438 40
14747 40
14982 40
16959 40
16999 40
17845 40
2520 40
2783 40
3132 40
3255 40
3349 40
3589 40
447 40
4679 40
5018 40
5498 40
6500 40
6988 40
10160 39
12869 39
13758 39
14559 39
16975 39
18089 39
181 39
18436 39
3587 39
5252 39
5954 39
6766 39
827 39
11779 38
12600 38
13185 38
1444 38
15605 38
15647 38
1666 38
16822 38
17107 38
1718 38
17357 38
17365 38
17770 38
19033 38
492 38
5907 38
6284 38
7068 38
7581 38
10925 37
11029 37
11048 37
12145 37
13071 37
13406 37
1394 37
14650 37
15439 37
16 37
16443 37
2647 37
3036 37
4534 37
749 37
9168 37
10219 36
1574 36
17050 36
17104 36
1818 36
19493 36
19818 36
2373 36
2758 36
3003 36
7567 36
761 36
91 36
9171 36
10171 35
10276 35
11877 35
12916 35
13052 35
14600 35
1805 35
2692 35
2717 35
3467 35
3751 35
4238 35
4910 35
5521 35
621 35
6476 35
8599 35
871 35
13853 34
14835 34
15470 34
1575 34
17177 34
17179 34
17479 34
17817 34
18125 34
18172 34
1825 34
19123 34
19396 34
19397 34
20203 34
3595 34
3860 34
523 34
853 34
9028 34
9466 34
10161 33
10193 33
10753 33
11857 33
12631 33
13399 33
13638 33
14187 33
14473 33
1699 33
17102 33
17137 33
18900 33
2037 33
4076 33
4391 33
5593 33
5600 33
5645 33
7749 33
8178 33
8880 33
9539 33
1139 32
1214 32
1306 32
14733 32
17363 32
17881 32
18870 32
2285 32
2550 32
2894 32
3294 32
6291 32
7017 32
7285 32
9589 32
9774 32
1327 31
1359 31
13835 31
14924 31
16513 31
17200 31
17510 31
17647 31
17901 31
18336 31
1930 31
2287 31
4182 31
4642 31
6367 31
6736 31
7271 31
7304 31
777 31
8151 31
1026 30
11472 30
13282 30
14911 30
15156 30
15176 30
15935 30
17339 30
18113 30
19561 30
2026 30
295 30
3097 30
348 30
3877 30
468 30
6778 30
728 30
76 30
10167 29
1020 29
11827 29
11834 29
11987 29
12111 29
13731 29
14686 29
14836 29
15067 29
16575 29
16887 29
395 29
4508 29
463 29
4786 29
5773 29
5799 29
6174 29
7862 29
8321 29
876 29
880 29
9235 29
11221 28
1200 28
12250 28
13081 28
14562 28
14908 28
16139 28
17099 28
17668 28
1787 28
19113 28
19337 28
19398 28
2952 28
4561 28
5900 28
7124 28
884 28
9085 28
10275 27
1171 27
1223 27
12810 27
1383 27
14580 27
14838 27
14863 27
15037 27
16415 27
17496 27
17565 27
18126 27
19187 27
2025 27
2109 27
3216 27
340 27
347 27
4919 27
5641 27
6774 27
7280 27
7913 27
8033 27
1086 26
11 26
116 26
13329 26
1427 26
14303 26
14592 26
16391 26
17083 26
17376 26
17503 26
19259 26
20410 26
2750 26
3353 26
4162 26
4463 26
4802 26
491 26
5141 26
57 26
650 26
677 26
7201 26
8147 26
9126 26
935 26
10952 25
11486 25
11807 25
12393 25
13027 25
13085 25
13363 25
13463 25
13907 25
14522 25
14847 25
15198 25
17157 25
17373 25
17455 25
17488 25
19344 25
214 25
4616 25
5619 25
5693 25
6052 25
8397 25
9080 25
910 25
9687 25
9956 25
10306 24
10956 24
1199 24
12760 24
1364 24
1384 24
14561 24
14672 24
14729 24
16066 24
17154 24
17275 24
294 24
3414 24
4467 24
462 24
4791 24
6661 24
6744 24
6841 24
7364 24
8184 24
9796 24
10800 23
11908 23
1393 23
17405 23
3264 23
3554 23
409 23
4121 23
5362 23
5390 23
5500 23
5949 23
6204 23
704 23
9031 23
9125 23
10224 22
10367 22
10598 22
14133 22
16961 22
16976 22
17345 22
17583 22
17838 22
17848 22
17947 22
1921 22
257 22
2734 22
274 22
3278 22
3700 22
481 22
5144 22
5638 22
5897 22
5941 22
646 22
6983 22
7041 22
7823 22
784 22
8426 22
8839 22
9045 22
9326 22
10153 21
11294 21
11485 21
11778 21
11781 21
1260 21
13004 21
13471 21
13776 21
1425 21
14518 21
14613 21
14651 21
14713 21
14752 21
178 21
17834 21
18018 21
190 21
2625 21
2926 21
3069 21
3331 21
3362 21
3663 21
3734 21
455 21
4624 21
6281 21
6753 21
7737 21
8573 21
9062 21
1147 20
11867 20
12683 20
12987 20
13310 20
1673 20
17181 20
17257 20
17545 20
18023 20
19952 20
20445 20
2078 20
2480 20
2885 20
3637 20
3866 20
4177 20
465 20
4667 20
4797 20
6503 20
6697 20
7253 20
7288 20
7830 20
7866 20
9127 20
10218 19
10265 19
10266 19
10981 19
11327 19
1269 19
13252 19
14760 19
14806 19
14854 19
16297 19
16485 19
17196 19
17381 19
17768 19
18532 19
18985 19
19562 19
2199 19
2222 19
3455 19
381 19
3914 19
4269 19
4649 19
4873 19
578 19
5921 19
6115 19
6546 19
7106 19
9200 19
9243 19
10859 18
10910 18
1159 18
11824 18
12092 18
13025 18
13096 18
13209 18
142 18
15078 18
15274 18
15341 18
1727 18
18251 18
2011 18
2257 18
2732 18
2754 18
2956 18
3261 18
3377 18
5401 18
629 18
6492 18
7133 18
7520 18
794 18
10865 17
1131 17
11436 17
11760 17
11997 17
12029 17
12139 17
12198 17
12275 17
12948 17
13146 17
14472 17
14620 17
15066 17
15229 17
15610 17
17084 17
17321 17
1759 17
17706 17
17754 17
1914 17
19334 17
2354 17
2576 17
2895 17
331 17
4255 17
4634 17
5389 17
5492 17
5909 17
5931 17
5964 17
5975 17
6265 17
678 17
8105 17
8596 17
9032 17
9181 17
10976 16
11114 16
11222 16
11799 16
12590 16
12720 16
13607 16
14669 16
14737 16
14970 16
15115 16
15133 16
16105 16
17069 16
17127 16
17150 16
17244 16
17427 16
17627 16
1801 16
19126 16
19215 16
3369 16
3461 16
4061 16
4223 16
4327 16
541 16
5458 16
5791 16
6277 16
6300 16
7029 16
7593 16
8058 16
808 16
8809 16
9604 16
10176 15
10303 15
10455 15
12280 15
1245 15
13108 15
13861 15
14566 15
14710 15
15053 15
1580 15
1756 15
17628 15
1765 15
18384 15
2633 15
3160 15
3295 15
4547 15
4759 15
4890 15
4914 15
4943 15
5143 15
636 15
6453 15
6826 15
7846 15
8585 15
9630 15
9998 15
10422 14
10548 14
11197 14
11692 14
11950 14
1215 14
12365 14
12981 14
13138 14
13290 14
1335 14
13782 14
14049 14
14961 14
15049 14
15131 14
15908 14
16742 14
17246 14
17269 14
17475 14
18813 14
19379 14
2534 14
2723 14
3194 14
3204 14
4433 14
4548 14
458 14
5126 14
5447 14
5622 14
628 14
6601 14
6695 14
7166 14
7261 14
7439 14
7707 14
7828 14
8237 14
861 14
9201 14
981 14
10490 13
1055 13
10965 13
11092 13
11213 13
1128 13
11379 13
11889 13
12039 13
12418 13
13566 13
136 13
13602 13
14090 13
14735 13
14771 13
14831 13
1500 13
15592 13
16484 13
17010 13
17019 13
17021 13
17131 13
17451 13
17724 13
17789 13
17852 13
179 13
18767 13
19546 13
19721 13
19891 13
20322 13
20644 13
2322 13
2358 13
2593 13
2611 13
2809 13
3011 13
3041 13
3438 13
3635 13
4174 13
4532 13
4623 13
4668 13
5817 13
5989 13
6481 13
6483 13
6536 13
686 13
6958 13
7216 13
7622 13
8011 13
8277 13
8428 13
10623 12
1073 12
12077 12
12199 12
1243 12
12637 12
12957 12
12980 12
13018 12
13059 12
13143 12
13606 12
13850 12
13860 12
15006 12
15032 12
15170 12
17060 12
17077 12
17184 12
17450 12
17597 12
18441 12
18647 12
2669 12
3410 12
3634 12
4113 12
4473 12
4546 12
5013 12
5288 12
635 12
7027 12
709 12
7499 12
782 12
7946 12
8153 12
8491 12
9060 12
9128 12
9603 12
976 12
10440 11
10481 11
10686 11
10921 11
1174 11
11798 11
12515 11
12612 11
12636 11
1277 11
13113 11
1357 11
14040 11
14578 11
14609 11
1461 11
14634 11
15283 11
15374 11
1549 11
15723 11
16824 11
17036 11
17180 11
17337 11
17601 11
1785 11
18296 11
18603 11
18706 11
1962 11
20134 11
2827 11
293 11
3120 11
387 11
4185 11
5582 11
5769 11
5806 11
6199 11
6238 11
6648 11
69 11
6968 11
7129 11
7193 11
8122 11
8284 11
8331 11
8525 11
8598 11
8990 11
9526 11
10690 10
10724 10
1074 10
10803 10
1096 10
1118 10
11185 10
11870 10
12021 10
12022 10
12712 10
13044 10
13843 10
14364 10
14389 10
14785 10
14917 10
14926 10
15029 10
15155 10
15882 10
165 10
17379 10
17408 10
1810 10
18379 10
18859 10
20051 10
2359 10
263 10
3226 10
332 10
3426 10
3456 10
3509 10
353 10
355 10
4864 10
5041 10
5183 10
5525 10
6114 10
6359 10
6365 10
8161 10
8217 10
8650 10
8758 10
8961 10
8974 10
9086 10
9099 10
9530 10
9865 10
10148 9
10586 9
10943 9
11223 9
11251 9
11580 9
1193 9
12257 9
12686 9
1275 9
12915 9
12923 9
13200 9
14502 9
14914 9
15177 9
15364 9
15462 9
1581 9
16284 9
16334 9
16447 9
16459 9
17465 9
17816 9
1872 9
18814 9
1946 9
20064 9
20224 9
21143 9
2634 9
3458 9
3466 9
3794 9
391 9
3941 9
4160 9
4723 9
4928 9
5221 9
6309 9
6666 9
6741 9
7183 9
7505 9
7586 9
7597 9
7703 9
7964 9
8015 9
8552 9
8866 9
9067 9
9150 9
9254 9
9455 9
9467 9
9703 9
10059 8
10126 8
10175 8
1027 8
10376 8
10546 8
10599 8
10636 8
10864 8
10914 8
10946 8
11144 8
11846 8
11954 8
12133 8
1252 8
12719 8
12975 8
13028 8
13521 8
13871 8
14084 8
14506 8
14700 8
14864 8
14929 8
15054 8
15094 8
15294 8
15737 8
16318 8
16390 8
16935 8
17012 8
17023 8
17038 8
17693 8
18006 8
18930 8
18957 8
18994 8
19581 8
19710 8
19930 8
20927 8
20975 8
2155 8
2286 8
2589 8
2718 8
2866 8
2899 8
3293 8
3407 8
3492 8
3693 8
3803 8
3918 8
4528 8
4660 8
4997 8
5242 8
5927 8
608 8
6482 8
6735 8
6912 8
6981 8
718 8
776 8
8523 8
8545 8
8749 8
8975 8
8996 8
9016 8
9024 8
9596 8
9673 8
9766 8
10209 7
10264 7
1045 7
10665 7
10674 7
10860 7
11008 7
11710 7
11780 7
11852 7
11952 7
12560 7
12794 7
1295 7
12988 7
1300 7
13167 7
13464 7
13685 7
13788 7
14188 7
14290 7
14302 7
145 7
14820 7
14963 7
15083 7
16130 7
16328 7
16386 7
16969 7
17043 7
17208 7
1738 7
17428 7
17570 7
17587 7
18160 7
18330 7
185 7
19112 7
1943 7
19471 7
19547 7
19650 7
19763 7
20996 7
2148 7
2424 7
2465 7
262 7
2863 7
2919 7
2980 7
314 7
323 7
3602 7
3932 7
4367 7
4529 7
4799 7
5260 7
5370 7
5574 7
5670 7
6175 7
648 7
7012 7
7031 7
7303 7
7393 7
762 7
7689 7
8430 7
8682 7
9504 7
9666 7
1000 6
10072 6
10121 6
10151 6
10513 6
10564 6
10821 6
10885 6
10964 6
11192 6
11305 6
11477 6
11528 6
11615 6
11735 6
11872 6
12019 6
12091 6
12144 6
12670 6
12950 6
12997 6
13196 6
13234 6
13245 6
13717 6
14154 6
14307 6
1449 6
14509 6
14619 6
14674 6
14897 6
15018 6
1521 6
15354 6
15865 6
16004 6
16801 6
16848 6
16911 6
16981 6
17086 6
17089 6
17105 6
17109 6
17120 6
17207 6
17454 6
17514 6
18607 6
18876 6
18923 6
19194 6
19288 6
19377 6
20122 6
21078 6
213 6
240 6
2892 6
301 6
3032 6
3238 6
3572 6
3728 6
374 6
3926 6
4188 6
5026 6
5153 6
5261 6
537 6
5377 6
5518 6
5703 6
5984 6
6110 6
6470 6
6496 6
6497 6
6909 6
741 6
7459 6
7647 6
7764 6
7805 6
7857 6
8100 6
8206 6
8317 6
838 6
8453 6
893 6
8998 6
9011 6
9123 6
9511 6
10112 5
10244 5
1038 5
1065 5
10779 5
10830 5
10831 5
10869 5
10912 5
10975 5
10995 5
11009 5
11382 5
11413 5
11728 5
11900 5
11961 5
12226 5
1233 5
12334 5
12380 5
12786 5
12917 5
12941 5
13072 5
13265 5
13530 5
13563 5
1371 5
1396 5
13971 5
14012 5
14593 5
14597 5
14697 5
14780 5
14837 5
15178 5
15284 5
1533 5
15569 5
15805 5
1624 5
16973 5
17000 5
17186 5
17230 5
17407 5
17506 5
17512 5
17566 5
17696 5
17835 5
17915 5
18019 5
18290 5
18769 5
19296 5
19375 5
19464 5
19584 5
19611 5
1970 5
20761 5
20794 5
2132 5
2325 5
2343 5
239 5
244 5
2499 5
2531 5
2674 5
2740 5
2797 5
2868 5
2893 5
3115 5
3224 5
3263 5
3265 5
3555 5
3620 5
3927 5
3959 5
4172 5
4334 5
435 5
4390 5
4477 5
4593 5
485 5
5256 5
531 5
5371 5
5386 5
5485 5
5690 5
5933 5
5952 5
5962 5
611 5
6294 5
637 5
6384 5
6762 5
6820 5
7184 5
7237 5
7396 5
7519 5
7882 5
8154 5
8187 5
8201 5
8244 5
8445 5
8499 5
8812 5
9272 5
9583 5
9633 5
9702 5
9756 5
9788 5
